# Location Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..Location Property
FamilyInstance Class See Also
---
This property is used to find the physical location of an instance within project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override Location Location { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property Location As Location
	Get
```

Visual C++
---
```text
public:
virtual property Location^ Location {
	Location^ get () override;
}
```

# Remarks
The Location property returns an object that can be used to find the location of an instance within the project. An instance may have a point location, such as a footing or may have a line location. A beam is an example of an instance that has a line location.
# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace